atanisoft/ESP32CommandStation/src/Interfaces/WebServer.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2019 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "ESP32CommandStation.h"
#include <ESPAsyncWebServer.h>
#include <AsyncJson.h>
#include <Update.h>

#include "WebServer.h"
#include "Outputs.h"
#include "Turnouts.h"
#include "S88Sensors.h"
#include "RemoteSensors.h"
#include "index_html.h"

enum HTTP_STATUS_CODES {
  STATUS_OK = 200,
  STATUS_NOT_MODIFIED = 304,
  STATUS_BAD_REQUEST = 400,
  STATUS_NOT_FOUND = 404,
  STATUS_NOT_ALLOWED = 405,
  STATUS_NOT_ACCEPTABLE = 406,
  STATUS_CONFLICT = 409,
  STATUS_PRECONDITION_FAILED = 412,
  STATUS_SERVER_ERROR = 500
};

class WebSocketClient : public DCCPPProtocolConsumer {
public:
  WebSocketClient(int clientID, IPAddress remoteIP) : _id(clientID), _remoteIP(remoteIP) {
  }
  virtual ~WebSocketClient() {}
  int getID() {
    return _id;
  }
  String getName() {
    return _remoteIP.toString() + "/" + String(_id);
  }
private:
  uint32_t _id;
  IPAddress _remoteIP;
};
LinkedList<WebSocketClient *> webSocketClients([](WebSocketClient *client) {delete client;});

static const char * _err2str(uint8_t _error){
    if(_error == UPDATE_ERROR_OK){
        return ("No Error");
    } else if(_error == UPDATE_ERROR_WRITE){
        return ("Flash Write Failed");
    } else if(_error == UPDATE_ERROR_ERASE){
        return ("Flash Erase Failed");
    } else if(_error == UPDATE_ERROR_READ){
        return ("Flash Read Failed");
    } else if(_error == UPDATE_ERROR_SPACE){
        return ("Not Enough Space");
    } else if(_error == UPDATE_ERROR_SIZE){
        return ("Bad Size Given");
    } else if(_error == UPDATE_ERROR_STREAM){
        return ("Stream Read Timeout");
    } else if(_error == UPDATE_ERROR_MD5){
        return ("MD5 Check Failed");
    } else if(_error == UPDATE_ERROR_MAGIC_BYTE){
        return ("Wrong Magic Byte");
    } else if(_error == UPDATE_ERROR_ACTIVATE){
        return ("Could Not Activate The Firmware");
    } else if(_error == UPDATE_ERROR_NO_PARTITION){
        return ("Partition Could Not be Found");
    } else if(_error == UPDATE_ERROR_BAD_ARGUMENT){
        return ("Bad Argument");
    } else if(_error == UPDATE_ERROR_ABORT){
        return ("Aborted");
    }
    return ("UNKNOWN");
}

DCCPPWebServer::DCCPPWebServer() : AsyncWebServer(80), webSocket("/ws") {
  rewrite("/", "/index.html");
  on("/index.html", HTTP_GET,
    [](AsyncWebServerRequest *request) {
      const char * htmlBuildTime = __DATE__ " " __TIME__;
      if (request->header("If-Modified-Since").equals(htmlBuildTime)) {
        request->send(STATUS_NOT_MODIFIED);
      } else {
        AsyncWebServerResponse *response = request->beginResponse_P(STATUS_OK, "text/html", indexHtmlGz, indexHtmlGz_size);
        response->addHeader("Content-Encoding", "gzip");
        response->addHeader("Last-Modified", htmlBuildTime);
        request->send(response);
      }
    });
  on("/features", HTTP_GET, [](AsyncWebServerRequest *request) {
    auto jsonResponse = new AsyncJsonResponse();
    JsonObject &root = jsonResponse->getRoot();
#if S88_ENABLED
    root[JSON_S88_NODE] = JSON_VALUE_TRUE;
    root[JSON_S88_SENSOR_BASE_NODE] = S88_FIRST_SENSOR;
#else
    root[JSON_S88_NODE] = JSON_VALUE_FALSE;
#endif
    jsonResponse->setCode(STATUS_OK);
    jsonResponse->setLength();
    request->send(jsonResponse);
  });
  on("/programmer", HTTP_GET | HTTP_POST,
    std::bind(&DCCPPWebServer::handleProgrammer, this, std::placeholders::_1));
  on("/power", HTTP_GET | HTTP_PUT,
    std::bind(&DCCPPWebServer::handlePower, this, std::placeholders::_1));
  on("/outputs", HTTP_GET | HTTP_POST | HTTP_PUT | HTTP_DELETE,
    std::bind(&DCCPPWebServer::handleOutputs, this, std::placeholders::_1));
  on("/turnouts", HTTP_GET | HTTP_POST | HTTP_PUT | HTTP_DELETE,
    std::bind(&DCCPPWebServer::handleTurnouts, this, std::placeholders::_1));
  on("/sensors", HTTP_GET | HTTP_POST | HTTP_DELETE,
    std::bind(&DCCPPWebServer::handleSensors, this, std::placeholders::_1));
#if S88_ENABLED
  on("/s88sensors", HTTP_GET | HTTP_POST | HTTP_DELETE,
    std::bind(&DCCPPWebServer::handleS88Sensors, this, std::placeholders::_1));
#endif
  on("/remoteSensors", HTTP_GET | HTTP_POST | HTTP_DELETE,
    std::bind(&DCCPPWebServer::handleRemoteSensors, this, std::placeholders::_1));
  on("/config", HTTP_POST | HTTP_DELETE,
    std::bind(&DCCPPWebServer::handleConfig, this, std::placeholders::_1));
  on("/locomotive", HTTP_GET | HTTP_POST | HTTP_PUT | HTTP_DELETE,
    std::bind(&DCCPPWebServer::handleLocomotive, this, std::placeholders::_1));
  on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {
    request->send(STATUS_OK, "text/plain", _err2str(Update.getError()));
  }, [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    if (!index) {
#if NEXTION_ENABLED
      nextionPages[TITLE_PAGE]->show();
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(0, "Firmware Upload Started...");
#endif
      otaInProgress = true;
      LOG(INFO, "Update starting...");
      InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, "Update starting");
      MotorBoardManager::powerOffAll();
      stopDCCSignalGenerators();
      if (!Update.begin(UPDATE_SIZE_UNKNOWN, U_FLASH)) {
#if NEXTION_ENABLED
        static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, _err2str(Update.getError()));
#endif
        InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, _err2str(Update.getError()));
        request->send(STATUS_BAD_REQUEST, "text/plain", _err2str(Update.getError()));
        Update.printError(Serial);
      }
    }
    if (Update.write(data, len) != len) {
#if NEXTION_ENABLED
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, _err2str(Update.getError()));
#endif
      InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, _err2str(Update.getError()));
      request->send(STATUS_BAD_REQUEST, "text/plain", _err2str(Update.getError()));
      Update.printError(Serial);
    } else {
      InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, "Updating: %d", Update.progress());
#if NEXTION_ENABLED
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, String("Progress: ") + String(Update.progress()));
#endif
    }
    if (final) {
      if (Update.end(true)) {
#if NEXTION_ENABLED
        static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, "Update Complete");
        static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(2, "Rebooting");
#endif
        InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, "Update Complete");
        otaComplete = true;
      } else {
#if NEXTION_ENABLED
        static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, _err2str(Update.getError()));
#endif
        InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, _err2str(Update.getError()));
        request->send(STATUS_BAD_REQUEST, "text/plain", _err2str(Update.getError()));
        Update.printError(Serial);
      }
    }
  });

