atanisoft/ESP32CommandStation/src/Interfaces/WebServer.cpp
  webSocket.onEvent([](AsyncWebSocket * server, AsyncWebSocketClient * client,
      AwsEventType type, void * arg, uint8_t *data, size_t len) {
    if (type == WS_EVT_CONNECT) {
      webSocketClients.add(new WebSocketClient(client->id(), client->remoteIP()));
      client->printf("<iDCC++ ESP32 Command Station: V-%s / %s %s>", VERSION, __DATE__, __TIME__);
  #if INFO_SCREEN_WS_CLIENTS_LINE >= 0
      InfoScreen::print(12, INFO_SCREEN_WS_CLIENTS_LINE, F("%02d"), webSocketClients.length());
  #endif
    } else if (type == WS_EVT_DISCONNECT) {
      WebSocketClient *toRemove = nullptr;
      for (const auto& clientNode : webSocketClients) {
        if(clientNode->getID() == client->id()) {
          toRemove = clientNode;
        }
      }
      if(toRemove != nullptr) {
        webSocketClients.remove(toRemove);
      }
  #if INFO_SCREEN_WS_CLIENTS_LINE >= 0
      InfoScreen::print(12, INFO_SCREEN_WS_CLIENTS_LINE, F("%02d"), webSocketClients.length());
  #endif
    } else if (type == WS_EVT_DATA) {
      for (const auto& clientNode : webSocketClients) {
        if(clientNode->getID() == client->id()) {
          clientNode->feed(data, len);
        }
      }
    }
  });
  addHandler(&webSocket);
}

void DCCPPWebServer::handleProgrammer(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse();
  if(!MotorBoardManager::getBoardByName(MOTORBOARD_NAME_PROG)->isOn()) {
    MotorBoardManager::powerOn(MOTORBOARD_NAME_PROG);
  }
  // new programmer request
  if (request->method() == HTTP_GET) {
    if (request->arg(JSON_PROG_ON_MAIN).equalsIgnoreCase(JSON_VALUE_TRUE)) {
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    } else if(request->hasArg(JSON_IDENTIFY_NODE)) {
      JsonObject &node = jsonResponse->getRoot();
      if(enterProgrammingMode()) {
        int16_t decoderConfig = readCV(CV_NAMES::DECODER_CONFIG);
        uint16_t decoderAddress = 0;
        if(decoderConfig > 0) {
          if(bitRead(decoderConfig, DECODER_CONFIG_BITS::DECODER_TYPE)) {
            uint8_t decoderManufacturer = readCV(CV_NAMES::DECODER_MANUFACTURER);
            int16_t addrMSB = readCV(CV_NAMES::ACCESSORY_DECODER_MSB_ADDRESS);
            int16_t addrLSB = readCV(CV_NAMES::SHORT_ADDRESS);
            if(addrMSB >= 0 && addrLSB >= 0) {
              if(decoderManufacturer == 0xA5) { // MERG uses 7 bit LSB
                decoderAddress = (uint16_t)(((addrMSB & 0x07) << 7) | (addrLSB & 0x7F));
              } else if(decoderManufacturer == 0x19) { // Team Digital uses 8 bit LSB and 4 bit MSB
                decoderAddress = (uint16_t)(((addrMSB & 0x0F) << 8) | addrLSB);
              } else { // NMRA spec shows 6 bit LSB
                decoderAddress = (uint16_t)(((addrMSB & 0x07) << 6) | (addrLSB & 0x1F));
              }
              node[JSON_ADDRESS_MODE_NODE] = JSON_VALUE_LONG_ADDRESS;
            } else {
              LOG(WARNING, "Failed to read address MSB/LSB");
              jsonResponse->setCode(STATUS_SERVER_ERROR);
            }
          } else {
            if(bitRead(decoderConfig, DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS)) {
              int16_t addrMSB = readCV(CV_NAMES::LONG_ADDRESS_MSB_ADDRESS);
              int16_t addrLSB = readCV(CV_NAMES::LONG_ADDRESS_LSB_ADDRESS);
              if(addrMSB >= 0 && addrLSB >= 0) {
                decoderAddress = (uint16_t)(((addrMSB & 0xFF) << 8) | (addrLSB & 0xFF));
                node[JSON_ADDRESS_MODE_NODE] = JSON_VALUE_LONG_ADDRESS;
              } else {
                LOG(WARNING, "Unable to read address MSB/LSB");
                jsonResponse->setCode(STATUS_SERVER_ERROR);
              }
            } else {
              int16_t shortAddr = readCV(CV_NAMES::SHORT_ADDRESS);
              if(shortAddr > 0) {
                decoderAddress = shortAddr;
                node[JSON_ADDRESS_MODE_NODE] = JSON_VALUE_SHORT_ADDRESS;
              } else {
                LOG(WARNING, "Unable to read short address CV");
                jsonResponse->setCode(STATUS_SERVER_ERROR);
              }
            }
            if(bitRead(decoderConfig, DECODER_CONFIG_BITS::SPEED_TABLE)) {
              node[JSON_SPEED_TABLE_NODE] = JSON_VALUE_ON;
            } else {
              node[JSON_SPEED_TABLE_NODE] = JSON_VALUE_OFF;
            }
          }
          if(decoderAddress > 0) {
            node[JSON_ADDRESS_NODE] = decoderAddress;
            auto roster = LocomotiveManager::getRosterEntry(decoderAddress, false);
            if(roster) {
              node[JSON_LOCO_NODE] = roster;
            } else if(request->hasArg(JSON_CREATE_NODE) && request->arg(JSON_CREATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE)) {
              roster = LocomotiveManager::getRosterEntry(decoderAddress);
              if(decoderConfig > 0) {
                if(bitRead(decoderConfig, DECODER_CONFIG_BITS::DECODER_TYPE)) {
                  roster->setType(JSON_VALUE_STATIONARY_DECODER);
                } else {
                  roster->setType(JSON_VALUE_MOBILE_DECODER);
                }
              }
              node[JSON_LOCO_NODE] = roster;
            }
          } else {
            LOG(WARNING, "Failed to read decoder address");
            jsonResponse->setCode(STATUS_SERVER_ERROR);
          }
        } else {
          LOG(WARNING, "Failed to read decoder configuration");
          jsonResponse->setCode(STATUS_SERVER_ERROR);
        }
        leaveProgrammingMode();
      } else {
        LOG(WARNING, "Programmer already in use");
        jsonResponse->setCode(STATUS_SERVER_ERROR);
      }
    } else {
      uint16_t cvNumber = request->arg(JSON_CV_NODE).toInt();
      if(enterProgrammingMode()) {
        int16_t cvValue = readCV(cvNumber);
        JsonObject &node = jsonResponse->getRoot();
        node[JSON_CV_NODE] = cvNumber;
        node[JSON_VALUE_NODE] = cvValue;
        if(cvValue < 0) {
          jsonResponse->setCode(STATUS_SERVER_ERROR);
        } else {
          jsonResponse->setCode(STATUS_OK);
        }
        leaveProgrammingMode();
      } else {
        LOG(WARNING, "Programmer already in use");
        jsonResponse->setCode(STATUS_SERVER_ERROR);
      }
    }
  } else if(request->method() == HTTP_POST && request->hasArg(JSON_PROG_ON_MAIN)) {
    if (request->arg(JSON_PROG_ON_MAIN).equalsIgnoreCase(JSON_VALUE_TRUE)) {
      if(request->hasArg(JSON_CV_BIT_NODE)) {
        writeOpsCVBit(request->arg(JSON_ADDRESS_NODE).toInt(), request->arg(JSON_CV_NODE).toInt(),
          request->arg(JSON_CV_BIT_NODE).toInt(), request->arg(JSON_VALUE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
      } else {
        writeOpsCVByte(request->arg(JSON_ADDRESS_NODE).toInt(), request->arg(JSON_CV_NODE).toInt(),
          request->arg(JSON_VALUE_NODE).toInt());
      }
      jsonResponse->setCode(STATUS_OK);
    } else {
      bool writeSuccess = false;
      if(enterProgrammingMode()) {
        if(request->hasArg(JSON_CV_BIT_NODE)) {
          writeSuccess = writeProgCVBit(request->arg(JSON_CV_NODE).toInt(), request->arg(JSON_CV_BIT_NODE).toInt(),
            request->arg(JSON_VALUE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
        } else {
          writeSuccess = writeProgCVByte(request->arg(JSON_CV_NODE).toInt(), request->arg(JSON_VALUE_NODE).toInt());
        }
        leaveProgrammingMode();
      }
      if(writeSuccess) {
        jsonResponse->setCode(STATUS_OK);
      } else {
        jsonResponse->setCode(STATUS_SERVER_ERROR);
      }
    }
  } else {
    jsonResponse->setCode(STATUS_BAD_REQUEST);
  }
  LOG(VERBOSE, "Setting response size");
  jsonResponse->setLength();
  LOG(VERBOSE, "Sending response, %d bytes", jsonResponse->getSize());
  request->send(jsonResponse);
  LOG(VERBOSE, "sent");
 }

void DCCPPWebServer::handlePower(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(true);
  if(request->method() == HTTP_GET) {
    if(request->params()) {
      ((JsonArray &)jsonResponse->getRoot()).createNestedObject()[JSON_STATE_NODE] = MotorBoardManager::isTrackPowerOn() ? JSON_VALUE_TRUE : JSON_VALUE_FALSE;
    } else {
      JsonArray &array = jsonResponse->getRoot();
      MotorBoardManager::getState(array);
    }
  } else if (request->method() == HTTP_PUT) {
    if(request->hasArg(JSON_OVERALL_STATE_NODE)) {
      if(request->arg(JSON_OVERALL_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE)) {
        MotorBoardManager::powerOnAll();
      } else {
        MotorBoardManager::powerOffAll();
      }
    } else if(request->hasArg(JSON_NAME_NODE)) {
      if(request->arg(JSON_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE)) {
        MotorBoardManager::powerOn(request->arg(JSON_NAME_NODE));
      } else {
        MotorBoardManager::powerOff(request->arg(JSON_NAME_NODE));
      }
    } else {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
 }

void DCCPPWebServer::handleOutputs(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(request->method() == HTTP_GET && !request->params());
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE)) {
    JsonArray &array = jsonResponse->getRoot();
    OutputManager::getState(array);
  } else if (request->method() == HTTP_GET) {
    auto output = OutputManager::getOutput(request->arg(JSON_ID_NODE).toInt());
    if(output) {
      output->toJson(jsonResponse->getRoot(), true);
    } else {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  } else if(request->method() == HTTP_POST) {
    uint16_t outputID = request->arg(JSON_ID_NODE).toInt();
    uint8_t pin = request->arg(JSON_PIN_NODE).toInt();
    bool inverted = request->arg(JSON_INVERTED_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    bool forceState = request->arg(JSON_FORCE_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    bool defaultState = request->arg(JSON_DEFAULT_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    uint8_t outputFlags = 0;
    if(inverted) {
      bitSet(outputFlags, OUTPUT_IFLAG_INVERT);
    }
    if(forceState) {
      bitSet(outputFlags, OUTPUT_IFLAG_RESTORE_STATE);
      if(defaultState) {
        bitSet(outputFlags, OUTPUT_IFLAG_FORCE_STATE);
      }
    }
    if(!OutputManager::createOrUpdate(outputID, pin, outputFlags)) {
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
  } else if(request->method() == HTTP_DELETE) {
    if(!OutputManager::remove(request->arg(JSON_ID_NODE).toInt())) {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  } else if(request->method() == HTTP_PUT) {
   OutputManager::toggle(request->arg(JSON_ID_NODE).toInt());
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

