atanisoft/ESP32CommandStation/src/Interfaces/WebServer.cpp
void DCCPPWebServer::handleTurnouts(AsyncWebServerRequest *request) {
  // GET /turnouts - full list of turnouts, note that turnout state is STRING type for display
  // GET /turnouts?readbleStrings=[0,1] - full list of turnouts, turnout state will be returned as true/false (boolean) when readableStrings=0.
  // GET /turnouts?address=<address> - retrieve turnout by DCC address
  // GET /turnouts?id=<id> - retrieve turnout by ID
  // PUT /turnouts?address=<address> - toggle turnout by DCC address
  // PUT /turnouts?id=<id> - toggle turnout by ID
  // POST /turnouts?id=<id>&address=<address>&subAddress=<subAddress>&type=<type> - creates a new turnout
  //      when id is -1 it will be auto-assigned as number of defined turnouts + 1.
  //      if subAddress is -1 the turnout will be defined as DCC address only.
  // DELETE /turnouts?id=<id> - delete turnout by ID
  // DELETE /turnouts?address=<address> - delete turnout by DCC address
  //
  // For successful requests the result code will be 200 and either an array of turnouts or single turnout will be returned.
  // For unsuccessful requests the result code will be 400 (bad request, missing args), 401 (not found), 500 (server failure).
  //

  // if the request is GET and we do not have an ID or ADDRESS parameter we need to return an array, otherwise a single entity.
  bool needArrayResponse = (
    request->method() == HTTP_GET &&
    !request->hasArg(JSON_ID_NODE) &&
    !request->hasArg(JSON_ADDRESS_NODE));
  auto jsonResponse = new AsyncJsonResponse(needArrayResponse);
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE)) {
    bool readableStrings = true;
    if(request->hasArg(JSON_TURNOUTS_READABLE_STRINGS_NODE)) {
      readableStrings = request->arg(JSON_TURNOUTS_READABLE_STRINGS_NODE).toInt();
    }
    JsonArray &array = jsonResponse->getRoot();
    TurnoutManager::getState(array, readableStrings);
  } else if (request->method() == HTTP_GET) {
    if(request->hasArg(JSON_ID_NODE)) {
      auto turnout = TurnoutManager::getTurnoutByID(request->arg(JSON_ID_NODE).toInt());
      if(turnout) {
        turnout->toJson(jsonResponse->getRoot());
      } else {
        jsonResponse->setCode(STATUS_NOT_FOUND);
      }
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      auto turnout = TurnoutManager::getTurnoutByID(request->arg(JSON_ADDRESS_NODE).toInt());
      if(turnout) {
        turnout->toJson(jsonResponse->getRoot());
      } else {
        jsonResponse->setCode(STATUS_NOT_FOUND);
      }
    } else {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  } else if(request->method() == HTTP_POST) {
    int32_t turnoutID = request->arg(JSON_ID_NODE).toInt();
    uint16_t turnoutAddress = request->arg(JSON_ADDRESS_NODE).toInt();
    int8_t turnoutSubAddress = request->arg(JSON_SUB_ADDRESS_NODE).toInt();
    TurnoutType type = (TurnoutType)request->arg(JSON_TYPE_NODE).toInt();
    // auto generate ID
    if(turnoutID == -1) {
      turnoutID = TurnoutManager::getTurnoutCount() + 1;
    }
    auto turnout = TurnoutManager::createOrUpdate((uint16_t)turnoutID, turnoutAddress, turnoutSubAddress, type);
    if(turnout) {
      turnout->toJson(jsonResponse->getRoot());
    } else {
      jsonResponse->setCode(STATUS_SERVER_ERROR);
    }
  } else if(request->method() == HTTP_DELETE) {
    if(request->hasArg(JSON_ID_NODE)) {
      TurnoutManager::removeByID(request->arg(JSON_ID_NODE).toInt());
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      TurnoutManager::removeByAddress(request->arg(JSON_ADDRESS_NODE).toInt());
    } else {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  } else if(request->method() == HTTP_PUT) {
    if(request->hasArg(JSON_ID_NODE)) {
      TurnoutManager::toggleByID(request->arg(JSON_ID_NODE).toInt());
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      TurnoutManager::toggleByAddress(request->arg(JSON_ADDRESS_NODE).toInt());
    } else {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

void DCCPPWebServer::handleSensors(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(request->method() == HTTP_GET && !request->params());
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE)) {
    JsonArray &array = jsonResponse->getRoot();
    SensorManager::getState(array);
  } else if (request->method() == HTTP_GET) {
    auto sensor = SensorManager::getSensor(request->arg(JSON_ID_NODE).toInt());
    if(sensor) {
      sensor->toJson(jsonResponse->getRoot());
    } else {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  } else if(request->method() == HTTP_POST) {
    uint16_t sensorID = request->arg(JSON_ID_NODE).toInt();
    uint8_t sensorPin = request->arg(JSON_PIN_NODE).toInt();
    bool sensorPullUp = request->arg(JSON_PULLUP_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    if(!SensorManager::createOrUpdate(sensorID, sensorPin, sensorPullUp)) {
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
  } else if(request->method() == HTTP_DELETE) {
    uint16_t sensorID = request->arg(JSON_ID_NODE).toInt();
    if(SensorManager::getSensorPin(sensorID) < 0) {
      // attempt to delete S88/RemoteSensor
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    } else if(!SensorManager::remove(sensorID)) {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

void DCCPPWebServer::handleConfig(AsyncWebServerRequest *request) {
  std::vector<String> arguments;
  if(request->method() == HTTP_POST) {
    DCCPPProtocolHandler::getCommandHandler("E")->process(arguments);
  } else {
    DCCPPProtocolHandler::getCommandHandler("e")->process(arguments);
  }
}

#if S88_ENABLED
void DCCPPWebServer::handleS88Sensors(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(true);
  if(request->method() == HTTP_GET) {
    JsonArray &array = jsonResponse->getRoot();
    S88BusManager::getState(array);
  } else if(request->method() == HTTP_POST) {
    if(!S88BusManager::createOrUpdateBus(
      request->arg(JSON_ID_NODE).toInt(),
      request->arg(JSON_PIN_NODE).toInt(),
      request->arg(JSON_COUNT_NODE).toInt())) {
      // duplicate pin/id
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
  } else if(request->method() == HTTP_DELETE) {
    S88BusManager::removeBus(request->arg(JSON_ID_NODE).toInt());
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}
#endif

void DCCPPWebServer::handleRemoteSensors(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(true);
  if(request->method() == HTTP_GET) {
    JsonArray &array = jsonResponse->getRoot();
    RemoteSensorManager::getState(array);
  } else if(request->method() == HTTP_POST) {
    RemoteSensorManager::createOrUpdate(request->arg(JSON_ID_NODE).toInt(),
      request->arg(JSON_VALUE_NODE).toInt());
  } else if(request->method() == HTTP_DELETE) {
    RemoteSensorManager::remove(request->arg(JSON_ID_NODE).toInt());
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

void DCCPPWebServer::handleLocomotive(AsyncWebServerRequest *request) {
  // method - url pattern - meaning
  // ANY /locomotive/estop - send emergency stop to all locomotives
  // GET /locomotive/roster - roster
  // GET /locomotive/roster?address=<address> - get roster entry
  // PUT /locomotive/roster?address=<address> - update roster entry
  // POST /locomotive/roster?address=<address> - create roster entry
  // DELETE /locomotive/roster?address=<address> - delete roster entry
  // GET /locomotive - get active locomotives
  // POST /locomotive?address=<address> - add locomotive to active management
  // GET /locomotive?address=<address> - get locomotive state
  // PUT /locomotive?address=<address>&speed=<speed>&dir=[FWD|REV]&fX=[true|false] - Update locomotive state, fX is short for function X where X is 0-28.
  // DELETE /locomotive?address=<address> - removes locomotive from active management
  const String url = request->url();
  auto jsonResponse = new AsyncJsonResponse(request->method() == HTTP_GET && !request->params());
  jsonResponse->setCode(STATUS_OK);
  // check if we have an eStop command, we don't care how this gets sent to the
  // command station (method) so check it first
  if(url.endsWith("/estop")) {
    LocomotiveManager::emergencyStop();
  } else if(url.indexOf("/roster") > 0) {
    if(request->method() == HTTP_GET && !request->hasArg(JSON_ADDRESS_NODE)) {
      LocomotiveManager::getRosterEntries(jsonResponse->getRoot());
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      if(request->method() == HTTP_DELETE) {
        LocomotiveManager::removeRosterEntry(request->arg(JSON_ADDRESS_NODE).toInt());
      } else {
        RosterEntry *entry = LocomotiveManager::getRosterEntry(request->arg(JSON_ADDRESS_NODE).toInt());
        if(request->method() == HTTP_PUT || request->method() == HTTP_POST) {
          if(request->hasArg(JSON_DESCRIPTION_NODE)) {
            entry->setDescription(request->arg(JSON_DESCRIPTION_NODE));
          }
          if(request->hasArg(JSON_TYPE_NODE)) {
            entry->setType(request->arg(JSON_TYPE_NODE));
          }
          if(request->hasArg(JSON_IDLE_ON_STARTUP_NODE)) {
            entry->setIdleOnStartup(request->arg(JSON_IDLE_ON_STARTUP_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
          if(request->hasArg(JSON_DEFAULT_ON_THROTTLE_NODE)) {
            entry->setDefaultOnThrottles(request->arg(JSON_DEFAULT_ON_THROTTLE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
        }
        entry->toJson(jsonResponse->getRoot());
      }
    }
  } else {
    // Since it is not an eStop or roster command we need to check the request
    // method and ensure it contains the required arguments otherwise the
    // request should be rejected
    if(request->method() == HTTP_GET && !request->hasArg(JSON_ADDRESS_NODE)) {
      // get all active locomotives
      LocomotiveManager::getActiveLocos(jsonResponse->getRoot()); 
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      auto loco = LocomotiveManager::getLocomotive(request->arg(JSON_ADDRESS_NODE).toInt());
      if(request->method() == HTTP_PUT || request->method() == HTTP_POST) {
        // Creation / Update of active locomotive
        bool needUpdate = false;
        if(request->hasArg(JSON_IDLE_NODE) && request->arg(JSON_IDLE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE)) {
          loco->setIdle();
          needUpdate = true;
        }
        if(request->hasArg(JSON_DIRECTION_NODE)) {
          loco->setDirection(request->arg(JSON_DIRECTION_NODE).equalsIgnoreCase(JSON_VALUE_FORWARD));
          needUpdate = true;
        }
        if(request->hasArg(JSON_SPEED_NODE)) {
          loco->setSpeed(request->arg(JSON_SPEED_NODE).toInt());
          needUpdate = true;
        }
        for(uint8_t funcID = 0; funcID <=28 ; funcID++) {
          String fArg = "f" + String(funcID);
          if(request->hasArg(fArg.c_str())) {
            loco->setFunction(funcID, request->arg(fArg.c_str()).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
        }
        if(needUpdate) {
          loco->sendLocoUpdate();
          loco->showStatus();
        }
      } else if(request->method() == HTTP_DELETE) {
        // Removal of an active locomotive
        LocomotiveManager::removeLocomotive(request->arg(JSON_ADDRESS_NODE).toInt());
#if NEXTION_ENABLED
        static_cast<NextionThrottlePage *>(nextionPages[THROTTLE_PAGE])->invalidateLocomotive(request->arg(JSON_ADDRESS_NODE).toInt());
#endif
      }
      loco->toJson(jsonResponse->getRoot());
    } else {
      // missing arg or unknown request
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

